---
layout: post
title: Welcome
---

## 关于博客

首先欢迎大家来到我的博客，我是胡明星，曾经有人以为这是我的网名，但其实这是我如假包换的真名哦，我的网名是鸟嘌呤或者是yopoing，本博客启用的域名humingxing.com和yopoing.com就是用我姓名的拼音和网名，每次我给学生做介绍的时候，学生都说我的名字特好记o(∩∩)o...我是一个不折不扣的程序猿&攻城狮&讲狮，从08年第一份工作到现在一直从事web开发和讲师相关的工作。

而说到博客，我并不陌生，从最初自己用asp自己写博客，到后来折腾wordpress，接触到很多不同样的博客技术，而遗憾的是每次博客搭建起来之后都没有静心下来去写过博客的内容，但有的时候，静心下来想想，每日奔波于工作和生活之间，其实是有很多可写可分享的内容。特别是在麦子学院重新开始做讲师的时候，每天都会有很多学生咨询各种各样的问题，他们或惑于学习思路，或苦于学习方法，或困于技术细节，每次在解答问题的时候，都很想把这些问题和回答都整理成文，这样才能帮助到更多的人。正是因为这样的想法，愈发让我觉得应当有一个地方能够把自己这些年的一些开发经验和技术收获分享给大家。于是就有了这个博客的存在，我会从讲师的角度去编写一些系列的技术原创教程和学习方法类的文章来帮助对web开发充满热情和兴趣的朋友们，希望以此帮助到大家，而我也能做一些更有意义的事情。这就是创建这个博客的初衷。

## 特别感谢

这个博客通过 [Jekyll](http://jekyllrb.com/) 生成，部署在 [Github](https://pages.github.com)，主题基于 [3-Jekyll](https://github.com/P233/3-Jekyll) 修改生成，非常感谢[Peiwen Lu](https://github.com/P233)开发出这么漂亮的主题，同时也非常感谢[suyan](https://github.com/suyan)对该主题进行的修改，增加了不少实用功能，也让主题变得更酷。

我博客的源码托管在[Github](https://github.com/yopoing/yopoing.github.io)上，如果有任何改进意见，欢迎讨论。
